# ![image](https://github.com/S1115161017/EC20204/assets/162283644/44882191-26f1-45a7-8f84-6eb89dbeb77a)
0312

![實作1](https://github.com/S1115161017/EC20204/assets/162283644/5fc3ad16-5fc2-448c-b65b-8bd1476b80db)
![實作2](https://github.com/S1115161017/EC20204/assets/162283644/87b6457e-0651-4d52-94fd-afe5de46b6e9)
![3](https://github.com/S1115161017/EC20204/assets/162283644/bd3f2bcf-db0b-4924-a218-db8b6f0e4cd9)
![4](https://github.com/S1115161017/EC20204/assets/162283644/685f9ab2-398d-4420-9462-ba170a986720)
![5](https://github.com/S1115161017/EC20204/assets/162283644/fa9a26e8-0493-4e9b-a181-4d7341af3e7b)

0326

![333](https://github.com/S1115161017/EC20204/assets/162283644/114e42cc-8281-473a-9464-4a8e137a8663)
![螢幕擷取畫面 2024-04-16 005717](https://github.com/S1115161017/EC20204/assets/162283644/c7a1f067-0dc5-4531-b4fc-bef7f3b356fc)
![螢幕擷取畫面 2024-04-16 011244](https://github.com/S1115161017/EC20204/assets/162283644/740ac067-1c3c-40f7-9812-a1293c156d8f)
f = 0 或 0 = 0
![螢幕擷取畫面 2024-04-16 011210](https://github.com/S1115161017/EC20204/assets/162283644/cbac532b-9f92-4b9b-be6d-4948a6e3b62b)
f = 1 或 0 = 1
![螢幕擷取畫面 2024-04-16 011422](https://github.com/S1115161017/EC20204/assets/162283644/48da50af-0805-4e7b-803d-3ca18eb3735b)
f = 1 或 1 = 1
![螢幕擷取![螢幕擷取畫面 2024-04-16 012028](https://github.com/S1115161017/EC20204/assets/162283644/f8e39930-5330-4e15-a442-b1a06fec2f5f)
f = 0 且 0 = 0
畫面 2024-04-16 012115](https://github.com/S1115161017/EC20204/assets/162283644/e8301ad1-f8b3-41b0-bf94-8472d3711f54)
f = 1 且 0 = 0
![螢幕擷取畫面 2024-04-16 020000](https://github.com/S1115161017/EC20204/assets/162283644/0de1df08-a6e7-41d5-9666-b25f708d1208)
f = 1 且 1 = 1

0402

![螢幕擷取畫面 2024-04-16 013118](https://github.com/S1115161017/EC20204/assets/162283644/4a1a4508-9279-4927-acaa-7f192215d3f9)

![螢幕擷取畫面 2024-04-16 014103](https://github.com/S1115161017/EC20204/assets/162283644/347059bc-e868-4d02-9f0c-608d5abe00bc)

有電容

![螢幕擷取畫面 2024-04-16 020719](https://github.com/S1115161017/EC20204/assets/162283644/157f0c51-300d-4c4f-8007-954ca189098d)
![螢幕擷取畫面 2024-04-16 020805](https://github.com/S1115161017/EC20204/assets/162283644/c2cbacdf-3211-4640-8e87-707c61df3056)

0409

![螢幕擷取畫面 2024-04-15 003817](https://github.com/S1115161017/EC20204/assets/162283644/4579158a-1ff4-4e19-8d28-79f78309b9a1)

1.全波整流是通過二極體橋式電路結構將輸入電壓的負電壓成分轉換為正電壓後整流成直流電壓（脈衝電壓）

2.橋式整流電路利用四個二極體的不同導通路徑，有效放電輸入的正負交流電訊號的兩個半週期都轉換為單向的直流電訊號輸出到負載電阻。

3.保證交流電的正負半週期能夠被正確地訊號轉換為單向的直流電訊號
![螢幕擷取畫面 2024-04-15 004127](https://github.com/S1115161017/EC20204/assets/162283644/6c67732a-311e-47b1-a7fb-6e9c5be0e18d)

1.阻隔直流電，讓交流電可以流過電容器

2.不知道(老師對不起)

3.0.5倍

![螢幕擷取畫面 2024-04-15 004555](https://github.com/S1115161017/EC20204/assets/162283644/44f2b7a4-1763-488d-bc3b-1513145a7d90)

1.不知道:D

2.LM7805常見的穩壓器晶片 直流電壓穩定為5伏特的直流電壓

3.最高25V

4.不知道

5.功率損耗=(輸入電壓×輸入電流)−(輸出電壓×輸出電流)

